/* SPDX-License-Identifier: BSD-2-Clause */
#ifndef __WF_DS_LWTBL_REGS_H__
#define __WF_DS_LWTBL_REGS_H__


#ifdef __cplusplus
extern "C" {
#endif

#ifndef REG_BASE_C_MODULE
// ----------------- WF_DS_LWTBL Bit Field Definitions -------------------

#define PACKING

typedef PACKING union
{
    PACKING struct
    {
        FIELD PEER_LINK_ADDRESS_47_32_  : 16;
        FIELD MUAR                      : 6;
        FIELD RCA1                      : 1;
        FIELD KID                       : 2;
        FIELD RCID                      : 1;
        FIELD BAND                      : 2;
        FIELD RV                        : 1;
        FIELD RCA2                      : 1;
        FIELD WPI_FLAG                  : 1;
        FIELD rsv_31                    : 1;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_PEER_INFO_DW00, *PWF_DS_LWTBL_REG_PEER_INFO_DW00;

typedef PACKING union
{
    PACKING struct
    {
        FIELD PEER_LINK_ADDRESS_31_0_   : 32;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_PEER_INFO_DW01, *PWF_DS_LWTBL_REG_PEER_INFO_DW01;

typedef PACKING union
{
    PACKING struct
    {
        FIELD AID                       : 12;
        FIELD GID_SU                    : 1;
        FIELD DUAL_PTEC_EN              : 1;
        FIELD DUAL_CTS_CAP              : 1;
        FIELD rsv_15                    : 1;
        FIELD CIPHER_SUIT_PGTK          : 5;
        FIELD FD                        : 1;
        FIELD TD                        : 1;
        FIELD SW                        : 1;
        FIELD UL                        : 1;
        FIELD TX_PS                     : 1;
        FIELD QOS                       : 1;
        FIELD HT                        : 1;
        FIELD VHT                       : 1;
        FIELD HE                        : 1;
        FIELD EHT                       : 1;
        FIELD MESH                      : 1;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_PEER_CAP_DW02, *PWF_DS_LWTBL_REG_PEER_CAP_DW02;

typedef PACKING union
{
    PACKING struct
    {
        FIELD WMM_Q                     : 2;
        FIELD EHT_SIG_MCS               : 2;
        FIELD HDRT_MODE                 : 1;
        FIELD BEAM_CHG                  : 1;
        FIELD EHT_LTF_SYM_NUM_OPT       : 2;
        FIELD PFMU_IDX                  : 8;
        FIELD ULPF_IDX                  : 8;
        FIELD RIBF                      : 1;
        FIELD ULPF                      : 1;
        FIELD BYPASS_TXSMM              : 1;
        FIELD TBF_HT                    : 1;
        FIELD TBF_VHT                   : 1;
        FIELD TBF_HE                    : 1;
        FIELD TBF_EHT                   : 1;
        FIELD IGN_FBK                   : 1;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_PEER_CAP_DW03, *PWF_DS_LWTBL_REG_PEER_CAP_DW03;

typedef PACKING union
{
    PACKING struct
    {
        FIELD NEGOTIATED_WINSIZE0       : 3;
        FIELD NEGOTIATED_WINSIZE1       : 3;
        FIELD NEGOTIATED_WINSIZE2       : 3;
        FIELD NEGOTIATED_WINSIZE3       : 3;
        FIELD NEGOTIATED_WINSIZE4       : 3;
        FIELD NEGOTIATED_WINSIZE5       : 3;
        FIELD NEGOTIATED_WINSIZE6       : 3;
        FIELD NEGOTIATED_WINSIZE7       : 3;
        FIELD PE                        : 2;
        FIELD DIS_RHTR                  : 1;
        FIELD LDPC_HT                   : 1;
        FIELD LDPC_VHT                  : 1;
        FIELD LDPC_HE                   : 1;
        FIELD LDPC_EHT                  : 1;
        FIELD BA_MODE                   : 1;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_PEER_CAP_DW04, *PWF_DS_LWTBL_REG_PEER_CAP_DW04;

typedef PACKING union
{
    PACKING struct
    {
        FIELD AF                        : 4;
        FIELD BSA_EN                    : 1;
        FIELD RTS                       : 1;
        FIELD SMPS                      : 1;
        FIELD DYN_BW                    : 1;
        FIELD MMSS                      : 3;
        FIELD USR                       : 1;
        FIELD SR_R                      : 3;
        FIELD SR_ABORT                  : 1;
        FIELD TX_POWER_OFFSET           : 6;
        FIELD LTF_EHT                   : 2;
        FIELD GI_EHT                    : 2;
        FIELD DOPPL                     : 1;
        FIELD TXOP_PS_CAP               : 1;
        FIELD DU_I_PSM                  : 1;
        FIELD I_PSM                     : 1;
        FIELD PSM                       : 1;
        FIELD SKIP_TX                   : 1;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_PEER_CAP_DW05, *PWF_DS_LWTBL_REG_PEER_CAP_DW05;

typedef PACKING union
{
    PACKING struct
    {
        FIELD CBRN                      : 3;
        FIELD DBNSS_EN                  : 1;
        FIELD BAF_EN                    : 1;
        FIELD RDGBA                     : 1;
        FIELD R                         : 1;
        FIELD SPE_IDX                   : 5;
        FIELD G2                        : 1;
        FIELD G4                        : 1;
        FIELD G8                        : 1;
        FIELD G16                       : 1;
        FIELD G2_LTF                    : 2;
        FIELD G4_LTF                    : 2;
        FIELD G8_LTF                    : 2;
        FIELD G16_LTF                   : 2;
        FIELD G2_HE                     : 2;
        FIELD G4_HE                     : 2;
        FIELD G8_HE                     : 2;
        FIELD G16_HE                    : 2;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_PEER_CAP_DW06, *PWF_DS_LWTBL_REG_PEER_CAP_DW06;

typedef PACKING union
{
    PACKING struct
    {
        FIELD BA_WIN_SIZE0              : 4;
        FIELD BA_WIN_SIZE1              : 4;
        FIELD BA_WIN_SIZE2              : 4;
        FIELD BA_WIN_SIZE3              : 4;
        FIELD BA_WIN_SIZE4              : 4;
        FIELD BA_WIN_SIZE5              : 4;
        FIELD BA_WIN_SIZE6              : 4;
        FIELD BA_WIN_SIZE7              : 4;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_PEER_CAP_DW07, *PWF_DS_LWTBL_REG_PEER_CAP_DW07;

typedef PACKING union
{
    PACKING struct
    {
        FIELD AC0_RTS_FAIL_CNT          : 5;
        FIELD AC1_RTS_FAIL_CNT          : 5;
        FIELD AC2_RTS_FAIL_CNT          : 5;
        FIELD AC3_RTS_FAIL_CNT          : 5;
        FIELD PARTIAL_AID               : 9;
        FIELD rsv_29                    : 2;
        FIELD CHK_PER                   : 1;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_PEER_CAP_DW08, *PWF_DS_LWTBL_REG_PEER_CAP_DW08;

typedef PACKING union
{
    PACKING struct
    {
        FIELD RX_AVG_MPDU_SIZE          : 14;
        FIELD PRITX_SW_MODE             : 1;
        FIELD PRITX_ERSU                : 1;
        FIELD PRITX_PLR                 : 2;
        FIELD PRITX_DCM                 : 1;
        FIELD PRITX_ER106T              : 1;
        FIELD FCAP                      : 3;
        FIELD MPDU_FAIL_CNT             : 3;
        FIELD MPDU_OK_CNT               : 3;
        FIELD RATE_IDX                  : 3;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_PEER_CAP_DW09, *PWF_DS_LWTBL_REG_PEER_CAP_DW09;

typedef PACKING union
{
    PACKING struct
    {
        FIELD RATE1                     : 15;
        FIELD rsv_15                    : 1;
        FIELD RATE2                     : 15;
        FIELD rsv_31                    : 1;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_AUTO_RATE_TABLE_DW10, *PWF_DS_LWTBL_REG_AUTO_RATE_TABLE_DW10;

typedef PACKING union
{
    PACKING struct
    {
        FIELD RATE3                     : 15;
        FIELD rsv_15                    : 1;
        FIELD RATE4                     : 15;
        FIELD rsv_31                    : 1;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_AUTO_RATE_TABLE_DW11, *PWF_DS_LWTBL_REG_AUTO_RATE_TABLE_DW11;

typedef PACKING union
{
    PACKING struct
    {
        FIELD RATE5                     : 15;
        FIELD rsv_15                    : 1;
        FIELD RATE6                     : 15;
        FIELD rsv_31                    : 1;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_AUTO_RATE_TABLE_DW12, *PWF_DS_LWTBL_REG_AUTO_RATE_TABLE_DW12;

typedef PACKING union
{
    PACKING struct
    {
        FIELD RATE7                     : 15;
        FIELD rsv_15                    : 1;
        FIELD RATE8                     : 15;
        FIELD rsv_31                    : 1;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_AUTO_RATE_TABLE_DW13, *PWF_DS_LWTBL_REG_AUTO_RATE_TABLE_DW13;

typedef PACKING union
{
    PACKING struct
    {
        FIELD RATE1_TX_CNT              : 16;
        FIELD RATE1_FAIL_CNT            : 16;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_AUTO_RATE_CTR_DW14_0, *PWF_DS_LWTBL_REG_AUTO_RATE_CTR_DW14_0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD rsv_0                     : 8;
        FIELD CIPHER_SUIT_IGTK          : 3;
        FIELD rsv_11                    : 1;
        FIELD CIPHER_SUIT_BIGTK         : 3;
        FIELD rsv_15                    : 17;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_AUTO_RATE_CTR_DW14_1, *PWF_DS_LWTBL_REG_AUTO_RATE_CTR_DW14_1;

typedef PACKING union
{
    PACKING struct
    {
        FIELD RATE2_OK_CNT              : 16;
        FIELD RATE3_OK_CNT              : 16;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_AUTO_RATE_CTR_DW15_0, *PWF_DS_LWTBL_REG_AUTO_RATE_CTR_DW15_0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD CURRENT_BW_TX_CNT         : 16;
        FIELD CURRENT_BW_FAIL_CNT       : 16;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_AUTO_RATE_CTR_DW16_0, *PWF_DS_LWTBL_REG_AUTO_RATE_CTR_DW16_0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD OTHER_BW_TX_CNT           : 16;
        FIELD OTHER_BW_FAIL_CNT         : 16;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_AUTO_RATE_CTR_DW17_0, *PWF_DS_LWTBL_REG_AUTO_RATE_CTR_DW17_0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD RTS_OK_CNT                : 16;
        FIELD RTS_FAIL_CNT              : 16;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_PPDU_CTR_DW18_0, *PWF_DS_LWTBL_REG_PPDU_CTR_DW18_0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD DATA_RETRY_CNT            : 16;
        FIELD MGNT_RETRY_CNT            : 16;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_PPDU_CTR_DW19_0, *PWF_DS_LWTBL_REG_PPDU_CTR_DW19_0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD AC0_CTT_CDT_CRB__CTT      : 32;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_ADM_CTR_DW20_0, *PWF_DS_LWTBL_REG_ADM_CTR_DW20_0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD AC0_CTB_CRT_CTB__CRT      : 32;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_ADM_CTR_DW21_0, *PWF_DS_LWTBL_REG_ADM_CTR_DW21_0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD AC1_CTT_CDT_CRB__CTMC     : 32;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_ADM_CTR_DW22_0, *PWF_DS_LWTBL_REG_ADM_CTR_DW22_0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD AC1_CTB_CRT_CTB__CRMC     : 32;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_ADM_CTR_DW23_0, *PWF_DS_LWTBL_REG_ADM_CTR_DW23_0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD AC2_CTT_CDT_CRB__CTDB     : 32;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_ADM_CTR_DW24_0, *PWF_DS_LWTBL_REG_ADM_CTR_DW24_0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD AC2_CTB_CRT_CTB__CRDB     : 32;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_ADM_CTR_DW25_0, *PWF_DS_LWTBL_REG_ADM_CTR_DW25_0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD AC3_CTT_CDT_CRB__CTODB    : 32;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_ADM_CTR_DW26_0, *PWF_DS_LWTBL_REG_ADM_CTR_DW26_0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD AC3_CTB_CRT_CTB__         : 32;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_ADM_CTR_DW27_0, *PWF_DS_LWTBL_REG_ADM_CTR_DW27_0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD RELATED_IDX0              : 12;
        FIELD RELATED_BAND0             : 2;
        FIELD PRIMARY_MLD_BAND          : 2;
        FIELD RELATED_IDX1              : 12;
        FIELD RELATED_BAND1             : 2;
        FIELD SECONDARY_MLD_BAND        : 2;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_MLO_INFO_DW28, *PWF_DS_LWTBL_REG_MLO_INFO_DW28;

typedef PACKING union
{
    PACKING struct
    {
        FIELD DISPATCH_POLICY0          : 2;
        FIELD DISPATCH_POLICY1          : 2;
        FIELD DISPATCH_POLICY2          : 2;
        FIELD DISPATCH_POLICY3          : 2;
        FIELD DISPATCH_POLICY4          : 2;
        FIELD DISPATCH_POLICY5          : 2;
        FIELD DISPATCH_POLICY6          : 2;
        FIELD DISPATCH_POLICY7          : 2;
        FIELD OWN_MLD_ID                : 6;
        FIELD EMLSR0                    : 1;
        FIELD EMLMR0                    : 1;
        FIELD EMLSR1                    : 1;
        FIELD EMLMR1                    : 1;
        FIELD EMLSR2                    : 1;
        FIELD EMLMR2                    : 1;
        FIELD rsv_28                    : 1;
        FIELD STR_BITMAP                : 3;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_MLO_INFO_DW29, *PWF_DS_LWTBL_REG_MLO_INFO_DW29;

typedef PACKING union
{
    PACKING struct
    {
        FIELD DISPATCH_ORDER            : 7;
        FIELD DISPATCH_RATIO            : 7;
        FIELD EMLSR_TRANS_DLY_IDX       : 2;
        FIELD LINK_MGF                  : 16;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_MLO_INFO_DW30, *PWF_DS_LWTBL_REG_MLO_INFO_DW30;

typedef PACKING union
{
    PACKING struct
    {
        FIELD rsv_0                     : 23;
        FIELD BFTX_TB                   : 1;
        FIELD DROP                      : 1;
        FIELD CASCAD                    : 1;
        FIELD ALL_ACK                   : 1;
        FIELD MPDU_SIZE                 : 2;
        FIELD RXD_DUP_MODE              : 2;
        FIELD ACK_EN                    : 1;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_RESP_INFO_DW31, *PWF_DS_LWTBL_REG_RESP_INFO_DW31;

typedef PACKING union
{
    PACKING struct
    {
        FIELD OM_INFO                   : 12;
        FIELD OM_INFO_EHT               : 4;
        FIELD RXD_DUP_FOR_OM_CHG        : 1;
        FIELD RXD_DUP_WHITE_LIST        : 12;
        FIELD rsv_29                    : 3;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_RX_DUP_INFO_DW32, *PWF_DS_LWTBL_REG_RX_DUP_INFO_DW32;

typedef PACKING union
{
    PACKING struct
    {
        FIELD USER_RSSI                 : 9;
        FIELD USER_SNR                  : 6;
        FIELD rsv_15                    : 1;
        FIELD RAPID_REACTION_RATE       : 12;
        FIELD rsv_28                    : 2;
        FIELD HT_AMSDU                  : 1;
        FIELD AMSDU_CROSS_LG            : 1;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_RX_STAT_DW33, *PWF_DS_LWTBL_REG_RX_STAT_DW33;

typedef PACKING union
{
    PACKING struct
    {
        FIELD RESP_RCPI0                : 8;
        FIELD RESP_RCPI1                : 8;
        FIELD RESP_RCPI2                : 8;
        FIELD RESP_RCPI3                : 8;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_RX_STAT_DW34, *PWF_DS_LWTBL_REG_RX_STAT_DW34;

typedef PACKING union
{
    PACKING struct
    {
        FIELD SNR_RX0                   : 8;
        FIELD SNR_RX1                   : 8;
        FIELD SNR_RX2                   : 8;
        FIELD SNR_RX3                   : 8;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_RX_STAT_DW35, *PWF_DS_LWTBL_REG_RX_STAT_DW35;

typedef PACKING union
{
    PACKING struct
    {
        FIELD VERSION_CODE              : 32;
    } Bits;
    uint32_t Raw;
} WF_DS_LWTBL_REG_VERSION_CODE, *PWF_DS_LWTBL_REG_VERSION_CODE;

// ----------------- WF_DS_LWTBL  Grouping Definitions -------------------
// ----------------- WF_DS_LWTBL Register Definition -------------------
typedef volatile PACKING struct
{
    WF_DS_LWTBL_REG_PEER_INFO_DW00  PEER_INFO_DW00;   // 8000
    uint32_t                          rsv_8004[7];      // 8004..801C
    WF_DS_LWTBL_REG_PEER_INFO_DW01  PEER_INFO_DW01;   // 8020
    uint32_t                          rsv_8024[7];      // 8024..803C
    WF_DS_LWTBL_REG_PEER_CAP_DW02   PEER_CAP_DW02;    // 8040
    uint32_t                          rsv_8044[7];      // 8044..805C
    WF_DS_LWTBL_REG_PEER_CAP_DW03   PEER_CAP_DW03;    // 8060
    uint32_t                          rsv_8064[7];      // 8064..807C
    WF_DS_LWTBL_REG_PEER_CAP_DW04   PEER_CAP_DW04;    // 8080
    uint32_t                          rsv_8084[7];      // 8084..809C
    WF_DS_LWTBL_REG_PEER_CAP_DW05   PEER_CAP_DW05;    // 80A0
    uint32_t                          rsv_80A4[7];      // 80A4..80BC
    WF_DS_LWTBL_REG_PEER_CAP_DW06   PEER_CAP_DW06;    // 80C0
    uint32_t                          rsv_80C4[7];      // 80C4..80DC
    WF_DS_LWTBL_REG_PEER_CAP_DW07   PEER_CAP_DW07;    // 80E0
    uint32_t                          rsv_80E4[7];      // 80E4..80FC
    WF_DS_LWTBL_REG_PEER_CAP_DW08   PEER_CAP_DW08;    // 8100
    uint32_t                          rsv_8104[7];      // 8104..811C
    WF_DS_LWTBL_REG_PEER_CAP_DW09   PEER_CAP_DW09;    // 8120
    uint32_t                          rsv_8124[7];      // 8124..813C
    WF_DS_LWTBL_REG_AUTO_RATE_TABLE_DW10 AUTO_RATE_TABLE_DW10; // 8140
    uint32_t                          rsv_8144[7];      // 8144..815C
    WF_DS_LWTBL_REG_AUTO_RATE_TABLE_DW11 AUTO_RATE_TABLE_DW11; // 8160
    uint32_t                          rsv_8164[7];      // 8164..817C
    WF_DS_LWTBL_REG_AUTO_RATE_TABLE_DW12 AUTO_RATE_TABLE_DW12; // 8180
    uint32_t                          rsv_8184[7];      // 8184..819C
    WF_DS_LWTBL_REG_AUTO_RATE_TABLE_DW13 AUTO_RATE_TABLE_DW13; // 81A0
    uint32_t                          rsv_81A4[7];      // 81A4..81BC
    WF_DS_LWTBL_REG_AUTO_RATE_CTR_DW14_0 AUTO_RATE_CTR_DW14_0; // 81C0
    WF_DS_LWTBL_REG_AUTO_RATE_CTR_DW14_1 AUTO_RATE_CTR_DW14_1; // 81C4
    uint32_t                          rsv_81C8[6];      // 81C8..81DC
    WF_DS_LWTBL_REG_AUTO_RATE_CTR_DW15_0 AUTO_RATE_CTR_DW15_0; // 81E0
    uint32_t                          rsv_81E4[7];      // 81E4..81FC
    WF_DS_LWTBL_REG_AUTO_RATE_CTR_DW16_0 AUTO_RATE_CTR_DW16_0; // 8200
    uint32_t                          rsv_8204[7];      // 8204..821C
    WF_DS_LWTBL_REG_AUTO_RATE_CTR_DW17_0 AUTO_RATE_CTR_DW17_0; // 8220
    uint32_t                          rsv_8224[7];      // 8224..823C
    WF_DS_LWTBL_REG_PPDU_CTR_DW18_0 PPDU_CTR_DW18_0;  // 8240
    uint32_t                          rsv_8244[7];      // 8244..825C
    WF_DS_LWTBL_REG_PPDU_CTR_DW19_0 PPDU_CTR_DW19_0;  // 8260
    uint32_t                          rsv_8264[7];      // 8264..827C
    WF_DS_LWTBL_REG_ADM_CTR_DW20_0  ADM_CTR_DW20_0;   // 8280
    uint32_t                          rsv_8284[7];      // 8284..829C
    WF_DS_LWTBL_REG_ADM_CTR_DW21_0  ADM_CTR_DW21_0;   // 82A0
    uint32_t                          rsv_82A4[7];      // 82A4..82BC
    WF_DS_LWTBL_REG_ADM_CTR_DW22_0  ADM_CTR_DW22_0;   // 82C0
    uint32_t                          rsv_82C4[7];      // 82C4..82DC
    WF_DS_LWTBL_REG_ADM_CTR_DW23_0  ADM_CTR_DW23_0;   // 82E0
    uint32_t                          rsv_82E4[7];      // 82E4..82FC
    WF_DS_LWTBL_REG_ADM_CTR_DW24_0  ADM_CTR_DW24_0;   // 8300
    uint32_t                          rsv_8304[7];      // 8304..831C
    WF_DS_LWTBL_REG_ADM_CTR_DW25_0  ADM_CTR_DW25_0;   // 8320
    uint32_t                          rsv_8324[7];      // 8324..833C
    WF_DS_LWTBL_REG_ADM_CTR_DW26_0  ADM_CTR_DW26_0;   // 8340
    uint32_t                          rsv_8344[7];      // 8344..835C
    WF_DS_LWTBL_REG_ADM_CTR_DW27_0  ADM_CTR_DW27_0;   // 8360
    uint32_t                          rsv_8364[7];      // 8364..837C
    WF_DS_LWTBL_REG_MLO_INFO_DW28   MLO_INFO_DW28;    // 8380
    uint32_t                          rsv_8384[7];      // 8384..839C
    WF_DS_LWTBL_REG_MLO_INFO_DW29   MLO_INFO_DW29;    // 83A0
    uint32_t                          rsv_83A4[7];      // 83A4..83BC
    WF_DS_LWTBL_REG_MLO_INFO_DW30   MLO_INFO_DW30;    // 83C0
    uint32_t                          rsv_83C4[7];      // 83C4..83DC
    WF_DS_LWTBL_REG_RESP_INFO_DW31  RESP_INFO_DW31;   // 83E0
    uint32_t                          rsv_83E4[7];      // 83E4..83FC
    WF_DS_LWTBL_REG_RX_DUP_INFO_DW32 RX_DUP_INFO_DW32; // 8400
    uint32_t                          rsv_8404[7];      // 8404..841C
    WF_DS_LWTBL_REG_RX_STAT_DW33    RX_STAT_DW33;     // 8420
    uint32_t                          rsv_8424[7];      // 8424..843C
    WF_DS_LWTBL_REG_RX_STAT_DW34    RX_STAT_DW34;     // 8440
    uint32_t                          rsv_8444[7];      // 8444..845C
    WF_DS_LWTBL_REG_RX_STAT_DW35    RX_STAT_DW35;     // 8460
    uint32_t                          rsv_8464[16102];  // 8464..7FF8
    uint8_t                           rsv_7FFC;         // 7FFC
    uint16_t                          rsv_7FFD;         // 7FFD
    WF_DS_LWTBL_REG_VERSION_CODE    VERSION_CODE;     // 7FFF
}WF_DS_LWTBL_REGS, *PWF_DS_LWTBL_REGS;

// ---------- WF_DS_LWTBL Enum Definitions      ----------
// ---------- WF_DS_LWTBL C Macro Definitions   ----------
extern PWF_DS_LWTBL_REGS g_WF_DS_LWTBL_BASE;

#define WF_DS_LWTBL_BASE                                       (g_WF_DS_LWTBL_BASE)

#define WF_DS_LWTBL_PEER_INFO_DW00                             INREG32(&WF_DS_LWTBL_BASE->PEER_INFO_DW00) // 8000
#define WF_DS_LWTBL_PEER_INFO_DW01                             INREG32(&WF_DS_LWTBL_BASE->PEER_INFO_DW01) // 8020
#define WF_DS_LWTBL_PEER_CAP_DW02                              INREG32(&WF_DS_LWTBL_BASE->PEER_CAP_DW02) // 8040
#define WF_DS_LWTBL_PEER_CAP_DW03                              INREG32(&WF_DS_LWTBL_BASE->PEER_CAP_DW03) // 8060
#define WF_DS_LWTBL_PEER_CAP_DW04                              INREG32(&WF_DS_LWTBL_BASE->PEER_CAP_DW04) // 8080
